it/src/InformationRegisters/РелизыКонфигураций/РелизыКонфигураций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РелизыКонфигураций</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Релиз</name>
    <type>
      <types>CatalogRef.Релизы</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаПубликации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Конфигурация</name>
    <type>
      <types>CatalogRef.Конфигурации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

it/src/InformationRegisters/КонфигурацииПользователей/КонфигурацииПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонфигурацииПользователей</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Конфигурация</name>
    <type>
      <types>CatalogRef.Конфигурации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

it/src/InformationRegisters/СостоянияУведомлений/СостоянияУведомлений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияУведомлений</name>
  <resources>
    <name>ПоследнийЗапуск</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Выполнено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СОшибками</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Конфигурация</name>
    <type>
      <types>CatalogRef.Конфигурации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Релиз</name>
    <type>
      <types>CatalogRef.Релизы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

it/src/Catalogs/ФизическиеЛица/ФизическиеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФизическиеЛица</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Администратор</name>
      <description>Администратор</description>
    </items>
  </predefined>
  <attributes>
    <name>НаименованиеСинхронизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Уволен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УчетныеЗаписи</name>
    <attributes>
      <name>УчетнаяЗапись</name>
      <type>
        <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

it/src/CommonModules/УправлениеЛентойНовостейСервер/Module.bsl
Функция СобытиеЖурналаРегистрации()
	
	Возврат НСтр("ru = 'Получение ленты новостей'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
	
КонецФункции


// Записывает событие-ошибку в журнал регистрации. Имя события
// "Получение файлов из Интернета".
// Параметры
//   СообщениеОбОшибке - строка сообщение об ошибке
// 
Процедура ЗаписатьОшибкуВЖурналРегистрации(Знач СообщениеОбОшибке)
	
#Если Сервер ИЛИ ВнешнееСоединение Тогда
	ЗаписьЖурналаРегистрации(
		СобытиеЖурналаРегистрации(),
		УровеньЖурналаРегистрации.Ошибка, , ,
		СообщениеОбОшибке);
#Иначе
	ОбщегоНазначенияКлиент.ДобавитьСообщениеДляЖурналаРегистрации(СобытиеЖурналаРегистрации(),
		"Ошибка", СообщениеОбОшибке,,Истина);
#КонецЕсли
	
КонецПроцедуры

// <Описание функции>
//
// Параметры
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ВернутьМесяцПоИмени(ИмяМесяца)

	СписокМесяцев = Новый СписокЗначений;
	СписокМесяцев.Добавить("Jan", "01");
	СписокМесяцев.Добавить("Feb", "02");
	СписокМесяцев.Добавить("Mar", "03");
	СписокМесяцев.Добавить("Apr", "04");
	СписокМесяцев.Добавить("May", "05");
	СписокМесяцев.Добавить("Jun", "06");
	СписокМесяцев.Добавить("Jul", "07");
	СписокМесяцев.Добавить("Aug", "08");
	СписокМесяцев.Добавить("Sep", "09");
	СписокМесяцев.Добавить("Oct", "10");
	СписокМесяцев.Добавить("Nov", "11");
	СписокМесяцев.Добавить("Dec", "12");
	
	НайденноеЗначение = СписокМесяцев.НайтиПоЗначению(ИмяМесяца);
	//Если НайденноеЗначение = Неопределено Тогда
	//	Возврат ТекущаяДата();
	//Иначе
		Возврат НайденноеЗначение.Представление;
	//КонецЕсли; 

КонецФункции // ВернутьМесяцПоИмени()

// <Описание функции>
//
// Параметры
//  <СтрокаДата>  - <Строка> - представления даты в международном формате
//                 Wed, 02 Oct 2013 17:40:00 +0400
//
// Возвращаемое значение:
//   <Дата>   - дата публикации
//
Функция ПривестиСтрокуКДате(СтрокаДата)

	Позиция = Найти(СтрокаДата, ","); 	//
	
	ДеньНедели 		= Лев(СтрокаДата, Позиция);
	СтрокаДатаВремя	= Прав(СтрокаДата, СтрДлина(СтрокаДата) - Позиция);
	МассивДаты		= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаДатаВремя, " ");
	
	//МассивДаты[0] - день
	//МассивДаты[1] - месяц
	//МассивДаты[2] - год
	//МассивДаты[3] - время
	//МассивДаты[4] - часовой пояс
	
	День 	= МассивДаты[0];     	
	Месяц 	= ВернутьМесяцПоИмени(МассивДаты[1]);
	Год		= МассивДаты[2];
	
	Время	= СтрЗаменить(МассивДаты[3], ":", "");
	
	Возврат Дата(Год + Месяц + День + Время);

КонецФункции // ПривестиСтрокуКДате()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ
// 

// Прочитать до конца XML тега
Процедура ЧитатьДоКонца(ЧтениеXML, ИмяЭлемента)
	Пока Истина Цикл
		Если ЧтениеXML.Имя = ИмяЭлемента и ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
			Прервать;
		Иначе	
			ЧтениеXML.Прочитать()
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Разобрать rss элемент
Процедура РазборRSS(ЧтениеXML, СодержимоеЛенты)
	Пока ЧтениеXML.Прочитать() Цикл
		Если ЧтениеXML.Имя = "channel" Тогда
			Если ЧтениеXML.Имя = "rss" и ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
				Прервать;
			КонецЕсли;
			
			РазборChannel(ЧтениеXML, СодержимоеЛенты);
			ЧитатьДоКонца(ЧтениеXML, "channel");
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Разобрать channel элемент
Процедура РазборChannel(ЧтениеXML, СодержимоеЛенты)
	Пока ЧтениеXML.Прочитать() Цикл
		Если ЧтениеXML.Имя = "channel" и ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
			Прервать;
		КонецЕсли;
		
		Если ЧтениеXML.Имя = "item" Тогда
			РазборItem(ЧтениеXML, СодержимоеЛенты);
			ЧитатьДоКонца(ЧтениеXML, "item");
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Разобрать item элемент
Процедура РазборItem(ЧтениеXML, СодержимоеЛенты)
	
	Элемент = СодержимоеЛенты.Добавить();
	
	Пока ЧтениеXML.Прочитать() Цикл
		Если ЧтениеXML.Имя = "item" и ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
			Прервать;
		КонецЕсли;
		
		Если ЧтениеXML.Имя = "title" Тогда
			ЧтениеXML.Прочитать();
			Элемент.Заголовок = ЧтениеXML.Значение;
			ЧитатьДоКонца(ЧтениеXML, "title");
		ИначеЕсли ЧтениеXML.Имя = "link" Тогда
			ЧтениеXML.Прочитать();
			Элемент.Ссылка = ЧтениеXML.Значение;
			ЧитатьДоКонца(ЧтениеXML, "link");
		ИначеЕсли ЧтениеXML.Имя = "category" Тогда
			ЧтениеXML.Прочитать();
			Элемент.Категория = ЧтениеXML.Значение;
			ЧитатьДоКонца(ЧтениеXML, "category");
		ИначеЕсли ЧтениеXML.Имя = "description" Тогда
			ЧтениеXML.Прочитать();
			Элемент.Текст = ЧтениеXML.Значение;
			ЧитатьДоКонца(ЧтениеXML, "description");
		ИначеЕсли ЧтениеXML.Имя = "pubDate" Тогда	
			ЧтениеXML.Прочитать();
			Элемент.ДатаПубликации = ЧтениеXML.Значение;
			ЧитатьДоКонца(ЧтениеXML, "pubDate");
        КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры


// <Описание процедуры>
//
// Параметры
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
Функция ПолучитьСодержимоеЛенты(ФайлНаВебСервере = Неопределено) Экспорт
	
	СодержимоеЛенты = Новый ТаблицаЗначений;
	СодержимоеЛенты.Колонки.Добавить("Заголовок");
	СодержимоеЛенты.Колонки.Добавить("Ссылка");
	СодержимоеЛенты.Колонки.Добавить("Категория");
	СодержимоеЛенты.Колонки.Добавить("Текст");
	СодержимоеЛенты.Колонки.Добавить("ДатаПубликации");
	
	Если ФайлНаВебСервере = Неопределено Тогда
		ФайлНаВебСервере = "http://downloads.1c.ru/release_info/rss-2.0.jsp";	
	КонецЕсли; 

	//Строка = ФайлНаВебСервере;
	//Строка = СтрЗаменить(Строка, "http://", "");
	//поз = Найти(Строка, "/");
	//Сервер = Лев(Строка, поз);
	//Ресурс = Прав(Строка, СтрДлина(Строка) - поз);
	
	//Соединение = Новый HTTPСоединение(Сервер);
	//ИмяФайла = ПолучитьИмяВременногоФайла(".rss");
	//Соединение.Получить(Ресурс, ИмяФайла);
	
	//#Если Клиент Тогда
	//	Результат = ПолучениеФайловИзИнтернетаКлиент.СкачатьФайлНаКлиенте(ФайлНаВебСервере);
	//#Иначе
		Результат = ПолучениеФайловИзИнтернета.СкачатьФайлНаСервере(ФайлНаВебСервере);
	//#КонецЕсли
	
	Если Результат.Статус Тогда
	
		ПараметрыЧтенияXML = Новый ПараметрыЧтенияXML(,,,, true, true, true, true, true);
		
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.ОткрытьФайл(Результат.Путь, ПараметрыЧтенияXML);
		
		ЧтениеXML.Прочитать();
		Если ЧтениеXML.Имя = "rss" Тогда
			РазборRSS(ЧтениеXML, СодержимоеЛенты);
		Иначе
			СообщениеОбОшибке	= "Ошибка разбора RSS.";
			ЗаписатьОшибкуВЖурналРегистрации(СообщениеОбОшибке);		
		КонецЕсли;
		
		ЧтениеXML.Закрыть();
		УдалитьФайлы(Результат.Путь);
		
	Иначе
		
		СообщениеОбОшибке	= "Невозможно получить данные ленты новостей.";
		ЗаписатьОшибкуВЖурналРегистрации(СообщениеОбОшибке);		
		
	КонецЕсли;	
	
	Возврат СодержимоеЛенты;

КонецФункции // ПолучитьСодержимоеЛенты()


Процедура ЗаписатьСодержимоеЛенты(СодержимоеЛенты) Экспорт
	
	Если ТипЗнч(СодержимоеЛенты) <> Тип("ТаблицаЗначений") Тогда
		СодержимоеЛенты = Новый ТаблицаЗначений;	
	КонецЕсли; 

	Если СодержимоеЛенты.Количество() > 0 Тогда
		
		Для каждого Строка Из СодержимоеЛенты Цикл
		
			Если ЗначениеЗаполнено(Строка.Заголовок) Тогда
			
				НайденнаяКонфигурация = Справочники.Конфигурации.НайтиПоНаименованию(Строка.Заголовок, Истина);
				Если НайденнаяКонфигурация = Справочники.Конфигурации.ПустаяСсылка() Тогда
					
					НоваяКонфигурация = Справочники.Конфигурации.СоздатьЭлемент();
					НоваяКонфигурация.Наименование 			= Строка.Заголовок;
					НоваяКонфигурация.НаименованиеПолное 	= Строка.Заголовок;
					
					Попытка
					
						НоваяКонфигурация.Записать();
					
					Исключение
						ЗаписатьОшибкуВЖурналРегистрации(ОписаниеОшибки());		
					КонецПопытки;
					
					НайденнаяКонфигурация = НоваяКонфигурация.Ссылка;
					
				КонецЕсли;
				
				НайденныйРелиз = Справочники.Релизы.НайтиПоНаименованию(Строка.Текст, Истина,, НайденнаяКонфигурация);
				Если НайденныйРелиз = Справочники.Релизы.ПустаяСсылка() Тогда
				
					НовыйРелиз = Справочники.Релизы.СоздатьЭлемент();
					НовыйРелиз.Владелец	= НайденнаяКонфигурация;
					НовыйРелиз.Наименование	= Строка.Текст;
					
					Попытка
						НовыйРелиз.Записать();
					Исключение
						ЗаписатьОшибкуВЖурналРегистрации(ОписаниеОшибки());		
					КонецПопытки;
					
					НайденныйРелиз = НовыйРелиз.Ссылка;
				
				КонецЕсли; 
				
				Период =  ПривестиСтрокуКДате(Строка.ДатаПубликации);
				
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				               |	РелизыКонфигурацийСрезПоследних.Релиз
				               |ИЗ
				               |	РегистрСведений.РелизыКонфигураций.СрезПоследних(
				               |			&МоментВремени,
				               |			Конфигурация = &Конфигурация
				               |				И Релиз = &Релиз) КАК РелизыКонфигурацийСрезПоследних";
							   
				Запрос.УстановитьПараметр("МоментВремени", 	Период);
				Запрос.УстановитьПараметр("Конфигурация", 	НайденнаяКонфигурация);
				Запрос.УстановитьПараметр("Релиз", 			НайденныйРелиз);
				
				Выборка = Запрос.Выполнить().Выбрать();
				Если Выборка.Количество() = 0 Тогда
				
					НаборЗаписей = РегистрыСведений.РелизыКонфигураций.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.Период.Установить(Период);
					НаборЗаписей.Отбор.Конфигурация.Установить(НайденнаяКонфигурация);
					
					НаборЗаписей.Прочитать();
					
					Если НаборЗаписей.Количество() = 0 Тогда
						
						НоваяЗапись = НаборЗаписей.Добавить();
						НоваяЗапись.Период          = Период;
						НоваяЗапись.Конфигурация    = НайденнаяКонфигурация;
						НоваяЗапись.Релиз			= НайденныйРелиз;
						НоваяЗапись.ДатаПубликации	= Строка.ДатаПубликации;
						
						Попытка
							НаборЗаписей.Записать();
						Исключение
							ЗаписатьОшибкуВЖурналРегистрации(ОписаниеОшибки());		
						КонецПопытки;
						
					КонецЕсли;
				
				КонецЕсли; 
			
			КонецЕсли; 
		
		КонецЦикла; 	
	
	КонецЕсли; 

КонецПроцедуры // ЗаписатьСодержимоеНаСервере()


// <Описание процедуры>
//
// Параметры
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
Процедура ЗагрузкаНовостейРегламентная() Экспорт

	СодержимоеЛенты = ПолучитьСодержимоеЛенты();
	ЗаписатьСодержимоеЛенты(СодержимоеЛенты);

КонецПроцедуры // ЗагрузкаНовостейРегламентная()


// <Описание процедуры>
//
// Параметры
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
Процедура ПриЗаписиРелизаКонфигурацииПриЗаписи(Источник, Отказ) Экспорт
	
	Если НЕ Отказ Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	КонфигурацииПользователей.ФизЛицо
		               |ИЗ
		               |	(ВЫБРАТЬ
		               |		КонфигурацииПользователей.ФизЛицо КАК ФизЛицо,
		               |		КонфигурацииПользователей.Конфигурация КАК Конфигурация
		               |	ИЗ
		               |		РегистрСведений.КонфигурацииПользователей КАК КонфигурацииПользователей
		               |	ГДЕ
		               |		КонфигурацииПользователей.Конфигурация = &Конфигурация
		               |		И КонфигурацииПользователей.Значение) КАК КонфигурацииПользователей
		               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		               |			СостоянияУведомлений.ФизЛицо КАК ФизЛицо,
		               |			СостоянияУведомлений.Конфигурация КАК Конфигурация
		               |		ИЗ
		               |			РегистрСведений.СостоянияУведомлений КАК СостоянияУведомлений
		               |		ГДЕ
		               |			СостоянияУведомлений.Релиз = &Релиз
		               |			И СостоянияУведомлений.Выполнено) КАК СостояниеУведомлений
		               |		ПО КонфигурацииПользователей.ФизЛицо = СостояниеУведомлений.ФизЛицо
		               |			И КонфигурацииПользователей.Конфигурация = СостояниеУведомлений.Конфигурация
		               |ГДЕ
		               |	ВЫБОР
		               |			КОГДА СостояниеУведомлений.ФизЛицо ЕСТЬ NULL 
		               |				ТОГДА ИСТИНА
		               |			ИНАЧЕ ЛОЖЬ
		               |		КОНЕЦ
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	КонфигурацииПользователей.ФизЛицо.Наименование";
					   
		Запрос.УстановитьПараметр("Конфигурация", 	Источник.Владелец);
		Запрос.УстановитьПараметр("Релиз",			Источник.Ссылка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		
		Пока Выборка.Следующий() Цикл
		
			Менеджер = РегистрыСведений.СостоянияУведомлений.СоздатьМенеджерЗаписи();
			Менеджер.ФизЛицо		= Выборка.ФизЛицо;
			Менеджер.Конфигурация	= Источник.Владелец;	
			Менеджер.Релиз			= Источник.Ссылка;
			
			Попытка
				Менеджер.Записать();
			Исключение
				ЗаписатьОшибкуВЖурналРегистрации(ОписаниеОшибки());		
			КонецПопытки;
		
		КонецЦикла; 
		
		//Создадим задачу Администратору	
			
		СтруктураДанных = Новый Структура;
		СтруктураДанных.Вставить("Дата", ТекущаяДата());
		СтруктураДанных.Вставить("Наименование", Источник.Владелец.Наименование);
		СтруктураДанных.Вставить("Предмет", Источник.Ссылка);
		СтруктураДанных.Вставить("РольИсполнителя", Справочники.РолиИсполнителей.ОтветственныйЗаКонтрольИсполнения);
		СтруктураДанных.Вставить("Описание", Источник.Ссылка.Наименование);
		
		ПодчиненныйБизнесПроцесс = УправлениеУчетнымиЗаписямиСервер.СоздатьИЗапуститьБизнесПроцесс(СтруктураДанных);
			
	
	КонецЕсли; 
	
КонецПроцедуры


// <Описание функции>
//
// Параметры
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ПолучитьОсновнойАдерсУведомления(Подписчик)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ФизическиеЛицаУчетныеЗаписи.УчетнаяЗапись
	               |ИЗ
	               |	Справочник.ФизическиеЛица.УчетныеЗаписи КАК ФизическиеЛицаУчетныеЗаписи
	               |ГДЕ
	               |	ФизическиеЛицаУчетныеЗаписи.Ссылка = &Ссылка";
				   
	Запрос.УстановитьПараметр("Ссылка", Подписчик);			   
				   
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() > 0 Тогда
		Выборка.Следующий();
		Возврат Выборка.УчетнаяЗапись;
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции // ПолучитьОсновнойАдерсУведомления()

// <Описание процедуры>
//
// Параметры
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
Процедура УстановитьОтметкуОбУспешнойОтправке(ТаблицаПараметров)
	
	Для каждого Строка Из ТаблицаПараметров Цикл
	
		НаборЗаписей = РегистрыСведений.СостоянияУведомлений.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ФизЛицо.Установить(Строка.ФизЛицо);
		НаборЗаписей.Отбор.Конфигурация.Установить(Строка.Конфигурация);
		НаборЗаписей.Отбор.Релиз.Установить(Строка.Релиз);
		
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Запись = НаборЗаписей[0];
		Запись.Выполнено = Истина;
		Запись.ПоследнийЗапуск = ТекущаяДата();
		
		Попытка
		
			НаборЗаписей.Записать();
		
		Исключение
		
		КонецПопытки;
		
	
	КонецЦикла; 	

КонецПроцедуры // УстановитьОтметкуОбУспешнойОтправке()
 

Процедура УведомлениеПодписчиковОНовыхКонфигурациях() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СостоянияУведомлений.ФизЛицо КАК ФизЛицо,
	|	СостоянияУведомлений.Конфигурация КАК Конфигурация,
	|	СостоянияУведомлений.Релиз КАК Релиз,
	|	СостоянияУведомлений.Выполнено КАК Выполнено,
	|	ФизическиеЛицаУчетныеЗаписи.УчетнаяЗапись
	|ИЗ
	|	РегистрСведений.СостоянияУведомлений КАК СостоянияУведомлений
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица.УчетныеЗаписи КАК ФизическиеЛицаУчетныеЗаписи
	|		ПО СостоянияУведомлений.ФизЛицо = ФизическиеЛицаУчетныеЗаписи.Ссылка
	|ГДЕ
	|	НЕ СостоянияУведомлений.Выполнено
	|ИТОГИ
	|ПО
	|	ФизЛицо,
	|	Конфигурация,
	|	Релиз";

	Результат = Запрос.Выполнить();

	ВыборкаЗаписиФизЛицо = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ФизЛицо");  
	Пока ВыборкаЗаписиФизЛицо.Следующий() Цикл
		
		//Создаем сообщение для подписчика
		Подписчик = ВыборкаЗаписиФизЛицо.ФизЛицо;
		
		ПочтовыйАдрес = ПолучитьОсновнойАдерсУведомления(Подписчик);
		Если ПочтовыйАдрес = Неопределено Тогда
			Продолжить;
		КонецЕсли; 
		
		ПараметрыПисьма = Новый Структура;
		ПараметрыПисьма.Вставить("Кому", ПочтовыйАдрес.Наименование);
		
		ТекстТемыПисьма = "Уведомление о выходе новых релизов";
		ПараметрыПисьма.Вставить("Тема", ТекстТемыПисьма);
		
		ТекстТелаПисьма	= "Сервис уведомлений сообщил о выходе новых релизов конфигураций: " + Символы.ПС;
		
		ТаблицаПараметров = Новый ТаблицаЗначений;
		ТаблицаПараметров.Колонки.Добавить("ФизЛицо");
		ТаблицаПараметров.Колонки.Добавить("Конфигурация");
		ТаблицаПараметров.Колонки.Добавить("Релиз");
		
		
		ВыборкаЗаписиКонфигурация = ВыборкаЗаписиФизЛицо.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Конфигурация");
		Пока ВыборкаЗаписиКонфигурация.Следующий() Цикл
		
			//Добавляем в сообщение конфигурацию
			Конфигурация = ВыборкаЗаписиКонфигурация.Конфигурация;
			
			ВыборкаЗаписиРелиз = ВыборкаЗаписиКонфигурация.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Релиз");   
			Пока ВыборкаЗаписиРелиз.Следующий() Цикл
				
				Релиз = ВыборкаЗаписиРелиз.Релиз;
				
				ТекстТелаПисьма = ТекстТелаПисьма + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1, %2'"), Конфигурация.Наименование, Релиз.Наименование) + Символы.ПС;
				
				НоваяСтрока = ТаблицаПараметров.Добавить();
				НоваяСтрока.ФизЛицо	= Подписчик;
				НоваяСтрока.Конфигурация	= Конфигурация; 
				НоваяСтрока.Релиз = Релиз;
				
			КонецЦикла;  
		
		КонецЦикла;
		
		
		ТекстТелаПисьма = ТекстТелаПисьма + "Вы получили это письмо, потому что просили сообщать Вам о выходе новых релизов данных конфигураций.";
		ПараметрыПисьма.Вставить("Тело", ТекстТелаПисьма);
		
		Попытка
			РаботаСПочтовымиСообщениями.ОтправитьСообщение(
			РаботаСПочтовымиСообщениями.ПолучитьСистемнуюУчетнуюЗапись(), ПараметрыПисьма);
			
			УстановитьОтметкуОбУспешнойОтправке(ТаблицаПараметров);
				
		Исключение
			//ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			//ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			//	НСтр("ru = 'Ошибка при отправке уведомления о новых релизах: %1.'"),
			//	ОписаниеОшибки);
			//УровеньВажностиСобытия = УровеньЖурналаРегистрации.Ошибка;
			ЗаписатьОшибкуВЖурналРегистрации(ОписаниеОшибки());
		КонецПопытки;
		
		
	КонецЦикла;

	
КонецПроцедуры


// Описание
// 
// Параметры:
Процедура ТестоваяУдалить()

Запрос = Новый Запрос;
Запрос.Текст = "ВЫБРАТЬ
|	ВидыЛицензий.Ссылка
|ИЗ
|	Справочник.ВидыЛицензий КАК ВидыЛицензий";	
	
	
	
КонецПроцедуры //ТестоваяУдалить
